import pandas as pd
import matplotlib.pyplot as plt

all_data = pd.read_csv('all_jobs.csv')

df = pd.DataFrame(all_data)


# Словарь с ключевыми словами для классификации по группам

group_keywords = {
    "IT и технологии": [
        "программист", "разработчик", "системный", "инженер", "data", "дата",
        "devops", "техподдержка", "системный администратор", "сетевой инженер",
        "технический писатель", "системный аналитик", "специалист по информационной безопасности",
        "специалист технической поддержки", "дата-сайентист", "bi-аналитик",
        "специалист по сертификации", "продуктовый аналитик",
    ],
    "Медицина и фармацевтика": [
        "врач", "медицинский", "ветеринар", "ассистент врача", "фармацевт",
        "медпредставитель", "главный врач", "заведующий отделением", "медицинская сестра",
        "медицинский брат", "фармацевт-провизор", "лаборант", "косметолог"
    ],
    "Финансы и бухгалтерия": [
        "бухгалтер", "финансовый", "аудитор", "казначей", "кредитный",
        "аналитик", "инвестиционный", "финансовый контролер", "финансовый менеджер",
        "финансовый аналитик", "комплаенс-менеджер", "андеррайтер", "казначей",
        "финансовый директор (cfo)"
    ],
    "Менеджмент и руководство": [
        "директор", "руководитель", "начальник", "менеджер", "управляющий",
        "координатор", "генеральный директор", "исполнительный директор (ceo)",
        "директор по информационным технологиям (cio)", "руководитель отдела",
        "менеджер по персоналу", "менеджер продукта", "менеджер/консультант по стратегии",
        "арт-директор", "креативный директор", "руководитель проектов",
        "начальник смены", "директор юридического департамента (clo)",
        "коммерческий директор (cco)", "операционный директор (coo)",
        "директор по маркетингу и pr (cmo)", "директор по персоналу (hrd)"
    ],
    "Связь с общественностью": [
        "pr", "маркетинг", "контент", "smm", "журналист", "редактор",
        "копирайтер", "психолог", "маркетолог-аналитик", "руководитель отдела маркетинга",
        "копирайтер, редактор", "smm-менеджер", "журналист, корреспондент",
        "event-менеджер", "продюсер", "режиссер", "сценарист", "контент-менеджер"
    ],
    "Производство и строительство": [
        "инженер", "строитель", "монтажник", "сварщик", "слесарь", "токарь",
        "механик", "мастер", "инженер-конструктор", "инженер-проектировщик",
        "инженер по качеству", "инженер-энергетик", "инженер-электрик",
        "инженер по охране труда", "прораб", "мастер смр", "мастер по ремонту",
        "инженер по эксплуатации", "технолог", "инженер пто", "инженер-сметчик",
        "инженер-электроник", "инженер-электронщик"
    ],
    "Торговля": [
        "продавец", "кассир", "мерчандайзер", "агент", "менеджер по продажам",
        "оценщик", "товаровед", "агент по недвижимости", "торговый представитель",
        "продавец-консультант", "продавец-кассир", "заведующий аптекой",
        "директор магазина", "директор сети магазинов", "администратор магазина",
        "администратор торгового зала"
    ],
    "Образование и наука": [
        "учитель", "преподаватель", "исследователь", "методист", "метролог",
        "научный специалист", "методолог", "учитель, преподаватель, педагог",
        "воспитатель", "няня", "научный специалист, исследователь"
    ],
    "Общественный сектор": [
        "охранник", "полицейский", "уборщик", "водитель", "военнослужащий",
        "дворник", "специалист по кадрам", "специалист службы безопасности",
        "курьер", "диспетчер", "машинист", "грузчик", "автослесарь", "автомеханик",
        "оператор call-центра", "специалист контактного центра", "упаковщик",
        "комплектовщик", "оператор пк", "архивариус"
    ],
    "Искусство и культура": [
        "артист", "актер", "аниматор", "фотограф", "ретушер", "дизайнер",
        "художник", "режиссер", "сценарист", "мастер ногтевого сервиса",
        "парикмахер", "массажист", "визажист", "стилист", "видеооператор",
        "видеомонтажер"
    ],
    "Гостиничный и ресторанный бизнес": [
        "менеджер ресторана", "официант", "бармен", "бариста", "повар",
        "пекарь", "кондитер", "хостес", "администратор"
    ],
    "Логистика и транспорт": [
            "менеджер по логистике", "менеджер по вэд", "начальник склада",
            "координатор отдела продаж", "оператор производственной линии",
            "специалист по тендерам", "специалист по взысканию задолженности",
            "руководитель отдела логистики"
    ],
    "Агропромышленность и экология": [
            "агроном", "зоотехник", "геолог", "инженер-эколог", "специалист по охране труда"
    ]
}
# Функция для определения группы на основе ключевых слов
def classify_job(professional_role):
    for group, keywords in group_keywords.items():
        if any(keyword.lower() in professional_role.lower() for keyword in keywords):
            return group
    return "Другое"


df["job_group"] = df["professional_roles_name"].apply(classify_job)

df.to_csv("catigorized_jobs.csv")




